'use strict';

const CATAGORIES_MOCK = [`Деревья`, `За жизнь`, `Без рамки`, `Разное`, `IT`, `Музыка`];

const PUBLICATIONS_MOCK = [
  {
    date: `1/12/1999`,
    picture: null,
    fullText: `Ёлки — это не просто красивое дерево. Это прочная древесина.`,
    title: `Ёлки. История деревьев`,
    announce: `Процессор заслуживает особого внимания. Он обязательно понравится геймерам со стажем.`,
    userId: 1,
  },
  {
    date: `1/12/2000`,
    picture: null,
    fullText: `Первая большая ёлка была установлена только в 1938 году.`,
    title: `Как перестать беспокоиться и начать жить`,
    announce: `Из под его пера вышло 8 платиновых альбомов.`,
    userId: 2,
  },
  {
    date: `1/12/2001`,
    picture: null,
    fullText: `Это один из лучших рок-музыкантов.`,
    title: `Что такое золотое сечение`,
    announce: `Бороться с прокрастинацией несложно. Просто действуйте. Маленькими шагами.`,
    userId: 3,
  },
  {
    date: `2/11/2023`,
    picture: null,
    fullText: `Он написал больше 30 хитов.`,
    title: `Учим HTML и CSS`,
    announce: `Игры и программирование разные вещи. Не стоит идти в программисты, если вам нравятся только игры.`,
    userId: 1,
  },
];





module.exports = {
  CATAGORIES_MOCK,
  PUBLICATIONS_MOCK,


};
